Revit 2027 API
RevolvedFace.Axis Property
Axis of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ Axis { get; }
Public ReadOnly Property Axis As XYZ
	Get
public:
property XYZ^ Axis {
	XYZ^ get ();
}
member Axis : XYZ with get
Property Value
XYZ
See Also
Reference
RevolvedFace Class
Autodesk.Revit.DB Namespace